OpenFOAM_Maincode/tutorials/incompressibleVoF/propeller/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            motionSolver;

    libs            ("libfvMeshMovers.so" "libfvMotionSolvers.so");

    motionSolver    solidBody;

    cellZone        innerCylinder;

    solidBodyMotionFunction  rotatingMotion;

    origin      (0 0 0);
    axis        (0 1 0);

    rpm         table
    (
        (0    0)
        (0.01  6000)
        (0.022  6000)
        (0.03  4000)
        (100   4000)
    );
}


// ************************************************************************* //
